OdDAI.InterruptCallback
\details
Type definition for pointer on a function that should be used for time-intensive processes interruption.

OdDAI.InterfaceSpecPtr
\details
A data type that represents a smart pointer to an InterfaceSpec object.

OdDAI.ExternalSchemaPtr
\details
A data type that represents a smart pointer to an ExternalSchema object.

OdDAI.InstanceFactoryPtr
\details
A data type that represents a smart pointer to an InstanceFactory object.

OdDAI.ExpressIDList
\details
A data type that represents an STD list of ANSI string objects.

OdDAI.BINARY
\details
A data type that represents the SDAI primitive BINARY type.

OdDAI.errorCodeToStr(System.UInt32)
\details
Retrieves a character representation of the specified error code.
\param errorId [in] An error code to get character representation for.
\returns A pointer to a null-terminated string that contains the character representation of the error code.
\sa
Standard Data Access Interface Error Handling

OdDAI.errorToDescription(System.UInt32)
\details
Retrieves a description of the specified error code.
\param errorId [in] An error code to get description for.
\returns A pointer to a null-terminated string that contains the error description.
\sa
Standard Data Access Interface Error Handling

OdDAI.daiErrorId
\details
A data type that is used to represent an error code that is used for event handling or events within the DAI module.